# Drop A Column

In [1]:
# Ignore
%load_ext sql
%sql sqlite://
%config SqlMagic.feedback = False

/Users/Kavi/anaconda/lib/python3.6/site-packages/IPython/config.py:13: ShimWarning: The `IPython.config` package has been deprecated. You should import from traitlets.config instead.
  "You should import from traitlets.config instead.", ShimWarning)
/Users/Kavi/anaconda/lib/python3.6/site-packages/IPython/utils/traitlets.py:5: UserWarning: IPython.utils.traitlets has moved to a top-level traitlets package.
  warn("IPython.utils.traitlets has moved to a top-level traitlets package.")

### Create Data

In [3]:
%%sql

-- Create a table of criminals
CREATE TABLE criminals (pid, name, age, sex, city, minor);
INSERT INTO criminals VALUES (412, 'James Smith', 15, 'M', 'Santa Rosa', 1);
INSERT INTO criminals VALUES (234, 'Bill James', 22, 'M', 'Santa Rosa', 0);
INSERT INTO criminals VALUES (632, 'Stacy Miller', 23, 'F', 'Santa Rosa', 0);
INSERT INTO criminals VALUES (621, 'Betty Bob', NULL, 'F', 'Petaluma', 1);
INSERT INTO criminals VALUES (162, 'Jaden Ado', 49, 'M', NULL, 0);
INSERT INTO criminals VALUES (901, 'Gordon Ado', 32, 'F', 'Santa Rosa', 0);
INSERT INTO criminals VALUES (512, 'Bill Byson', 21, 'M', 'Santa Rosa', 0);
INSERT INTO criminals VALUES (411, 'Bob Iton', NULL, 'M', 'San Francisco', 0);

[]

### View Table

In [4]:
%sql SELECT * FROM criminals

[(412, 'James Smith', 15, 'M', 'Santa Rosa', 1),
 (234, 'Bill James', 22, 'M', 'Santa Rosa', 0),
 (632, 'Stacy Miller', 23, 'F', 'Santa Rosa', 0),
 (621, 'Betty Bob', None, 'F', 'Petaluma', 1),
 (162, 'Jaden Ado', 49, 'M', None, 0),
 (901, 'Gordon Ado', 32, 'F', 'Santa Rosa', 0),
 (512, 'Bill Byson', 21, 'M', 'Santa Rosa', 0),
 (411, 'Bob Iton', None, 'M', 'San Francisco', 0)]

### Delete Column (Most Common)
%%sql

-- Alter the table called 'criminals' ALTER TABLE criminals

-- From the table 'criminals' DROP COLUMN age

### Delete Column (SQLite)
SQLite (the version of SQL used in this tutorial) does not allow you to drop a column. The workaround is to make a new table that contains only the columns you want to keep, then rename the new table to the original template's name.

In [7]:
%%sql

CREATE TABLE criminals_temp(pid, name, sex);

INSERT INTO criminals_temp SELECT pid, name, sex FROM criminals

DROP TABLE criminals;

ALTER TABLE criminals_temp RENAME TO criminals;

(sqlite3.OperationalError) table criminals_temp already exists [SQL: 'CREATE TABLE criminals_temp(pid, name, sex);']

### View Table

In [8]:
%sql SELECT * FROM criminals

[(412, 'James Smith', 15, 'M', 'Santa Rosa', 1),
 (234, 'Bill James', 22, 'M', 'Santa Rosa', 0),
 (632, 'Stacy Miller', 23, 'F', 'Santa Rosa', 0),
 (621, 'Betty Bob', None, 'F', 'Petaluma', 1),
 (162, 'Jaden Ado', 49, 'M', None, 0),
 (901, 'Gordon Ado', 32, 'F', 'Santa Rosa', 0),
 (512, 'Bill Byson', 21, 'M', 'Santa Rosa', 0),
 (411, 'Bob Iton', None, 'M', 'San Francisco', 0)]

Source: https://chrisalbon.com/sql/drop_a_column.html